## 빅데이터 기반 AI 응용 솔루션 개발자 전문과정

#### 교과목명 : Python 분석라이브러리 활용

- 평가일 : 21.7.26
- 성명 : 채승혜
- 점수 :  93점

### Q1. arange(), reshape() 이용 1차원 2차원 3차원 배열을 아래와 같이 생성하세요.
1차원  
[ 1  2  3  4  5  6  7  8  9 10 11 12 13 14 15 16 17 18 19 20]  

2차원  
[[ 1  2  3  4  5]  
  [ 6  7  8  9 10]  
  [11 12 13 14 15]  
  [16 17 18 19 20]] 

3차원  
[[[ 1  2  3  4  5]  
  [ 6  7  8  9 10]]  
 
 [[11 12 13 14 15]  
  [16 17 18 19 20]]]

In [4]:
import numpy as np
import pandas as pd

print(np.arange(1,21))
print()
print(np.arange(1,21).reshape(4,5))
print()
print(np.arange(1,21).reshape(2,2,5))

[ 1  2  3  4  5  6  7  8  9 10 11 12 13 14 15 16 17 18 19 20]

[[ 1  2  3  4  5]
 [ 6  7  8  9 10]
 [11 12 13 14 15]
 [16 17 18 19 20]]

[[[ 1  2  3  4  5]
  [ 6  7  8  9 10]]

 [[11 12 13 14 15]
  [16 17 18 19 20]]]

### Q2. 1 ~ 100 까지 배열에서 3과 7의 공배수중에서 42의 배수인 것만을 출력하세요.

In [11]:
ar = np.arange(1,101)
A= ar[(ar%3==0) & (ar%7==0)]
A[A%42==0]

array([42, 84])

### Q3. 아래 3차원 배열을 생성하여 출력한 후 1차원으로 변환하여 출력하세요.(reshape() 사용)

[[[ 0  1  2  3]  
  [ 4  5  6  7]  
  [ 8  9 10 11]]  
  
 [[12 13 14 15]  
  [16 17 18 19]  
  [20 21 22 23]]]

In [13]:
df1= np.arange(24).reshape(2,3,4)
print(df1)
print()
print(df1.reshape(-1,))

[[[ 0  1  2  3]
  [ 4  5  6  7]
  [ 8  9 10 11]]

 [[12 13 14 15]
  [16 17 18 19]
  [20 21 22 23]]]

[ 0  1  2  3  4  5  6  7  8  9 10 11 12 13 14 15 16 17 18 19 20 21 22 23]

### Q4. array2d에서 인덱스를 이용해서 값을 선택하고 리스트로 아래와 같이 출력하세요.
arr2d = np.arange(11,20).reshape(3,3)

[13 16]  

[[11 12]  
 [14 15]]

[[11 12 13]  
 [14 15 16]]

In [19]:
arr2d = np.arange(11,20).reshape(3,3)
print(arr2d)
print()

arr2d_1=arr2d[0:2,2]
print(arr2d_1)
print()

arr2d_2= arr2d[0:2,0:2]
print(arr2d_2)
print()

arr2d_3= arr2d[0:2,:]
print(arr2d_3)
print()

[[11 12 13]
 [14 15 16]
 [17 18 19]]

[13 16]

[[11 12]
 [14 15]]

[[11 12 13]
 [14 15 16]]

### Q5. 아래 두행렬을 np.arange, reshape를 이용해서 생성 각각 a1, b1으로 저장하고 행렬 내적을 계산한 결과를 출력하세요.

[[ 1  2  3  4  5]  
 [ 6  7  8  9 10]  
 [11 12 13 14 15]]

[[10 11 12 13  
 [14 15 16 17]  
 [18 19 20 21]  
 [22 23 24 25]  
 [26 27 28 29]]

In [21]:
a1= np.arange(1,16).reshape(3,-1)
b1= np.arange(10,30).reshape(5,-1)
a1.dot(b1)

array([[ 310,  325,  340,  355],
       [ 760,  800,  840,  880],
       [1210, 1275, 1340, 1405]])

### Q6. ar의 역행렬을 출력하고 검증을 수행하세요.
지수표현식을 실수 표현으로 변경 : np.set_printoptions(precision=6, suppress=True)

In [22]:
import numpy as np
np.random.seed(1)
ar = np.random.randint(1,6,size=(5,5))
ar

array([[4, 5, 1, 2, 4],
       [1, 1, 2, 5, 5],
       [2, 3, 5, 3, 5],
       [4, 5, 3, 5, 3],
       [5, 2, 2, 1, 2]])

In [24]:
np.set_printoptions(precision=6, suppress=True)
ar2= np.linalg.inv(ar)
print(ar2)
print()
print(ar.dot(ar2))

[[-0.039801  0.039801 -0.11194  -0.012438  0.278607]
 [ 0.174129 -0.174129  0.052239  0.116915 -0.218905]
 [-0.195688 -0.137645  0.241294  0.063847  0.036484]
 [-0.139303  0.139303 -0.141791  0.206468 -0.024876]
 [ 0.190713  0.14262   0.057214 -0.252902 -0.001658]]

[[ 1. -0.  0.  0. -0.]
 [-0.  1. -0. -0. -0.]
 [-0.  0.  1.  0. -0.]
 [ 0.  0.  0.  1. -0.]
 [ 0.  0.  0.  0.  1.]]

### Q7. 표준정규분포 난수로 10행 5열 2차원 배열 ar을 생성하고 ar_test 이름으로 저장한 후 다시 불러내서 출력하세요.

## 틀림 (2,10,5) --> 3차원 배열로 만들어서...
아니.. .

In [123]:
ar= np.random.randn(2,10,5)

# print(ar)

np.save('ar_test',ar)
np.load('ar_test.npy')

array([[ 0.978738,  2.240893,  1.867558, -0.977278,  0.950088],
       [-0.151357, -0.103219,  0.410599,  0.144044,  1.454274],
       [ 0.761038,  0.121675,  0.443863,  0.333674,  1.494079],
       [-0.205158,  0.313068, -0.854096, -2.55299 ,  0.653619],
       [ 0.864436, -0.742165,  2.269755, -1.454366,  0.045759],
       [-0.187184,  1.532779,  1.469359,  0.154947,  0.378163],
       [-0.887786, -1.980796, -0.347912,  0.156349,  1.230291],
       [ 1.20238 , -0.387327, -0.302303, -1.048553, -1.420018],
       [-1.70627 ,  1.950775, -0.509652, -0.438074, -1.252795],
       [ 0.77749 , -1.613898, -0.21274 , -0.895467,  0.386902]])

### Q8. df = sns.load_dataset('titanic')로 불러와서 다음 작업을 수행한 후 출력하세요.
- 전체 칼럼중 'survived','who','adult_male','deck','embark_town','alive','alone' 칼럼을 제외한
df_x 데이터프레임을 생성한 후 dataset/df_x.pkl로 저장한다.
- df_x.pkl을 데이터프레임 df_x 이름으로 불러온 후 앞 5개 행을 출력한다.

In [32]:
import seaborn as sns

df=sns.load_dataset('titanic')
df_x= df.drop(['survived','who','adult_male','deck',
               'embark_town','alive','alone' ],axis=1)

df_x.to_pickle('./dataset/df_x.pkl')
pd.read_pickle('./dataset/df_x.pkl').head()

   pclass     sex   age  sibsp  parch     fare embarked  class
0       3    male  22.0      1      0   7.2500        S  Third
1       1  female  38.0      1      0  71.2833        C  First
2       3  female  26.0      0      0   7.9250        S  Third
3       1  female  35.0      1      0  53.1000        S  First
4       3    male  35.0      0      0   8.0500        S  Third

### Q9. Q.8의 df_x에서 각 칼럼별 null 개수를 구하세요.

In [33]:
df_x.isnull().sum()

pclass        0
sex           0
age         177
sibsp         0
parch         0
fare          0
embarked      2
class         0
dtype: int64

### Q10. df_x의 전체 null 갯수를 계산하세요.

In [34]:
df_x.isnull().sum().sum()

179

### Q11. tdf에서 fare를 3개 카테고리로 구분하는 새로운 칼럼 'fare_age'를 생성하여 출력하세요. 단, 카테고리 구분을 수행하는 사용자 함수를 만들고 그 함수를 fare 칼럼에 매핑하여 결과를 tdf에 저장하고 출력하세요.

[카테고리]  
fare <= 7.9: cat = 'T'  
fare <= 31: cat = 'S'  
fare > 31 : cat = 'F'

In [36]:
import seaborn as sns
df = sns.load_dataset('titanic')
tdf = df[['survived','sex','age','class','fare']]
tdf.head()

   survived     sex   age  class     fare
0         0    male  22.0  Third   7.2500
1         1  female  38.0  First  71.2833
2         1  female  26.0  Third   7.9250
3         1  female  35.0  First  53.1000
4         0    male  35.0  Third   8.0500

In [41]:
import warnings
warnings.filterwarnings('ignore')

def fare_cat(x):
    if x <= 7.9:
        x = 'T'
    elif x <= 31:
        x='S'
    else:
        x='F'
    return x

tdf['fare_age'] = tdf['fare'].apply(lambda x : fare_cat(x))

tdf.head()

   survived     sex   age  class     fare fare_age
0         0    male  22.0  Third   7.2500        T
1         1  female  38.0  First  71.2833        F
2         1  female  26.0  Third   7.9250        S
3         1  female  35.0  First  53.1000        F
4         0    male  35.0  Third   8.0500        S

### Q12.  df의 gender, code 칼럼을 '_'으로 연결한 'gc'칼럼을 추가한 후 출력하세요. 단, 타입변환을 유의해서 수행하세요.
연결 예시 : m_10

In [43]:
df = pd.DataFrame({'gender' : ['m', 'f', 'f'],\
                   'code' : [10, 20, 30]})
df

  gender  code
0      m    10
1      f    20
2      f    30

In [52]:
df['code'] = df['code'].astype(str)
df['gc'] = df['gender']+'_'+df['code']
df.head()

  gender code    gc
0      m   10  m_10
1      f   20  f_20
2      f   30  f_30

### Q13. join() 메소드는 두 데이터프레임의 행 인덱스를 기준으로 결합한다. 2개의 주식데이터를 가져와서 join() 메소드로 아래와 같이 결합한 후 다음 사항을 수행하세요.
- 데이터 셋
1. 'dataset/stock price.xlsx'
2. 'dataset/stock valuation.xlsx'
- df1과 df2의 합집합이 출력되도록 결합하여 df4에 저장하고 출력
- df4에서 중복된 칼럼 name 을 삭제한 후 블린 인덱싱을 이용하여 eps가 10000 보다 크고 stock_name이 이마트인 데이터를 선택하여 데이터프레임을 생성하고 df5 이름으로 저장 및 출력하세요.(단, '<' 와 '==' 를 반드시 사용해야 함)

In [129]:
import pandas as pd
df1= pd.read_excel('stock price.xlsx')
df2= pd.read_excel('stock valuation.xlsx')
#index_col= 'id ' 설정 or l~rsuffix

# df1
# df2

df4= df1.join(df2,lsuffix='_1',rsuffix='_2',how='outer')
# df4
df4.drop_duplicates(['name']).head()
# df4
df5= df4[(df4.eps>10000)| (df4.stock_name=='이마트')]   
df5

,id_1,stock_name,value,price,id_2,name,eps,bps,per,pbr
3,139480,이마트,239230.833333,254500,139480,이마트,18268.166667,295780,13.931338,0.860437

### Q14.  df의 score1 과 score2 컬럼을 합한 숫자로 구성된 새로운 컬럼 score3을 생성 후 df를 출력하세요.

In [77]:
import numpy as np
import pandas as pd
np.random.seed(0)
df = pd.DataFrame(np.random.randint(123456789,123456791,size=(2,2)),columns= ['score1','score2'])
df['score1'] = '123,234,567'
df

        score1     score2
0  123,234,567  123456790
1  123,234,567  123456789

In [78]:
df.info()
def rep_int(score1):
    score1 = score1.replace(',', '')
    return int(score1)

df['score1']=df['score1'].apply(rep_int)
df['score3']=df['score1']+df['score2']


df

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   score1  2 non-null      object
 1   score2  2 non-null      int32
dtypes: int32(1), object(1)
memory usage: 152.0+ bytes

      score1     score2     score3
0  123234567  123456790  246691357
1  123234567  123456789  246691356

### Q15. auto_df의 horsepower 컬럼에서 숫자가 아닌 원소들을 0으로 대체한 후에 전체 평균을 구한 후 소숫점 2째 자리까지만 출력하세요.

In [122]:
import pandas as pd
auto_df = pd.read_csv('dataset/auto-mpg.csv')
auto_df.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,car name
0,18.0,8,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350.0,165,3693,11.5,70,1,buick skylark 320
2,18.0,8,318.0,150,3436,11.0,70,1,plymouth satellite
3,16.0,8,304.0,150,3433,12.0,70,1,amc rebel sst
4,17.0,8,302.0,140,3449,10.5,70,1,ford torino

In [120]:
a= auto_df['horsepower'].replace('?',0)

b= a.astype(int)

c= b.mean().round(2)

c

102.89

### Q16. './dataset/stock-data.csv'를 데이터프레임으로 불러와서 Date 컬럼 판다스 Timestamp로 변환한 후 인덱스로 셋팅하고 Date 컬럼은 삭제한 후 처음 5개 행만 출력하세요.

In [113]:
df_1= pd.read_csv('./dataset/stock-data.csv')

df_1['Date'] = pd.to_datetime(df_1['Date'])



df_2=df_1.set_index('Date')

df_2.head()

            Close  Start   High    Low  Volume
Date
2018-07-02  10100  10850  10900  10000  137977
2018-06-29  10700  10550  10900   9990  170253
2018-06-28  10400  10900  10950  10150  155769
2018-06-27  10900  10800  11050  10500  133548
2018-06-26  10800  10900  11000  10700   63039

### Q17. titanic 데이터셋에서 아래 5개 열을 선택하고 sex 컬럼을 기준으로 그룹화를 수행한 후 다음 사항을 출력하세요.
5개 열 : ['age','sex', 'class', 'fare', 'survived']  
- 그룹별 평균 출력
- 그룹별 최대값 출력

In [96]:
import pandas as pd
import seaborn as sns

titanic = sns.load_dataset('titanic')

mean_= titanic[['age','sex', 'class', 'fare', 'survived']].groupby('sex').mean()
max_=  titanic[['age','sex', 'class', 'fare', 'survived']].groupby('sex').max()

mean_

              age       fare  survived
sex
female  27.915709  44.479818  0.742038
male    30.726645  25.523893  0.188908

In [97]:
max_

         age      fare  survived
sex
female  63.0  512.3292         1
male    80.0  512.3292         1

### Q18. titanic 데이터셋에서 class, age, fare, survived 4개 컬럼만 선택하여 df를 생성한 후 class 컬럼의  'First'그룹만을 선택해서 group1 이름으로 저장하고 통계요약표를 출력하세요.

In [95]:
df=titanic[['class', 'age', 'fare', 'survived']]
group1= df.groupby('class').get_group('First')
group1.describe()

              age        fare    survived
count  186.000000  216.000000  216.000000
mean    38.233441   84.154687    0.629630
std     14.802856   78.380373    0.484026
min      0.920000    0.000000    0.000000
25%     27.000000   30.923950    0.000000
50%     37.000000   60.287500    1.000000
75%     49.000000   93.500000    1.000000
max     80.000000  512.329200    1.000000

### Q19. titanic 데이터셋에서 class 열, sex열 기준으로 그룹화한 후 그룹별 최대값과 최소값을 구하세요.

In [90]:
titanic = sns.load_dataset('titanic')
df = titanic[['class','sex', 'age', 'fare', 'survived']]
df.head()

   class     sex   age     fare  survived
0  Third    male  22.0   7.2500         0
1  First  female  38.0  71.2833         1
2  Third  female  26.0   7.9250         1
3  First  female  35.0  53.1000         1
4  Third    male  35.0   8.0500         0

In [91]:
import seaborn as sns

max_=df.groupby([df['class'],df['sex']]).max()
min_=df.groupby([df['class'],df['sex']]).min()

max_

                age      fare  survived
class  sex
First  female  63.0  512.3292         1
       male    80.0  512.3292         1
Second female  57.0   65.0000         1
       male    70.0   73.5000         1
Third  female  63.0   69.5500         1
       male    74.0   69.5500         1

In [92]:
min_

                age     fare  survived
class  sex
First  female  2.00  25.9292         0
       male    0.92   0.0000         0
Second female  2.00  10.5000         0
       male    0.67   0.0000         0
Third  female  0.75   6.7500         0
       male    0.42   0.0000         0

### Q20.  titanic 데이터셋에서 다음 전처리를 수행하세요.
1. df에서 'survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare', 'embarked', 'deck' 컬럼만을 선택하여 df1 이름으로 저장 후 출력하세요. 
2. df1에서 null값이 50% 이상인 칼럼은 삭제한 후 df2를 생성하고 df2에 null이 있는 컬럼은 적절한 값으로 대체한 후 df2의 null값의 갯수가 0인지 확인하세요.
3. df2에서 문자로 되어있는 칼럼들을 원핫 인코딩 수행하여 숫자로 변환 후 처음 5개 행을 출력하세요

In [132]:
import seaborn as sns
df = sns.load_dataset('titanic')
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [133]:
df1= df[[ 'survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare', 'embarked', 'deck']]
df1.head()

   survived  pclass     sex   age  sibsp  parch     fare embarked deck
0         0       3    male  22.0      1      0   7.2500        S  NaN
1         1       1  female  38.0      1      0  71.2833        C    C
2         1       3  female  26.0      0      0   7.9250        S  NaN
3         1       1  female  35.0      1      0  53.1000        S    C
4         0       3    male  35.0      0      0   8.0500        S  NaN

In [134]:
df1.isnull().sum()

survived      0
pclass        0
sex           0
age         177
sibsp         0
parch         0
fare          0
embarked      2
deck        688
dtype: int64

In [137]:
df2= df1.drop('deck',axis=1)
df2.age.fillna(df2['age'].mean(),inplace=True)
df2.head()

   survived  pclass     sex   age  sibsp  parch     fare embarked
0         0       3    male  22.0      1      0   7.2500        S
1         1       1  female  38.0      1      0  71.2833        C
2         1       3  female  26.0      0      0   7.9250        S
3         1       1  female  35.0      1      0  53.1000        S
4         0       3    male  35.0      0      0   8.0500        S

## embarked null값 안없앰 ㅠ

In [139]:
df2.isnull().sum().sum()

2

In [86]:
from sklearn.preprocessing import LabelEncoder 

le= LabelEncoder()
features= ['sex','fare','embarked']

for feature in features:
    df2[feature]= le.fit_transform(df2[feature])  
df2.head()

   survived  pclass  sex   age  sibsp  parch  fare  embarked
0         0       3    1  22.0      1      0    18         2
1         1       1    0  38.0      1      0   207         0
2         1       3    0  26.0      0      0    41         2
3         1       1    0  35.0      1      0   189         2
4         0       3    1  35.0      0      0    43         2

## 엥 원핫 안보고 인코딩만 봐서 레이블 인코딩을 써서했내..

In [ ]:
pd.get_dummies(df2).head()